online_benchmark_log/mi35x/GROK1/v0.5.5.post3-rocm700-mi35x-20251120_GROK1_MOE-I4F8_online/sglang_client_log_GROK1_aiter_2_run1_20251120_145053.log
Running benchmark with request rate: 2 (Run 1) for mode aiter
Run started at: 2025-11-20 14:56:24 PST
Executing: python3 -m sglang.bench_serving --backend sglang --tokenizer "/data/amd--grok-1-W4A8KV8" --dataset-name random --random-input 1024 --random-output 1024 --num-prompts 600 --request-rate 2
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=None, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer='/data/amd--grok-1-W4A8KV8', num_prompts=600, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=2.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, dataset_name='random', dataset_path='', model='/data/amd--grok-1-W4A8KV8', served_model_name=None, tokenizer='/data/amd--grok-1-W4A8KV8', num_prompts=600, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=2.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 308748
#Output tokens: 308712
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 600/600 [05:38<00:00,  1.77it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    2.0       
Max request concurrency:                 not set   
Successful requests:                     600       
Benchmark duration (s):                  338.88    
Total input tokens:                      308748    
Total input text tokens:                 308748    
Total input vision tokens:               0         
Total generated tokens:                  308712    
Total generated tokens (retokenized):    316745    
Request throughput (req/s):              1.77      
Input token throughput (tok/s):          911.09    
Output token throughput (tok/s):         910.98    
Total token throughput (tok/s):          1822.07   
Concurrency:                             45.43     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   25657.11  
Median E2E Latency (ms):                 25391.95  
---------------Time to First Token----------------
Mean TTFT (ms):                          156.62    
Median TTFT (ms):                        125.78    
P99 TTFT (ms):                           366.27    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          49.97     
Median TPOT (ms):                        47.49     
P99 TPOT (ms):                           65.82     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           49.66     
Median ITL (ms):                         42.71     
P95 ITL (ms):                            77.26     
P99 ITL (ms):                            173.65    
Max ITL (ms):                            593.61    
==================================================
Run completed at: 2025-11-20 15:02:13 PST
Run duration: 349 seconds
----------------------------------------